---
type: InsulationLiningBase
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# InsulationLiningBase

`Autodesk.Revit.DB.InsulationLiningBase` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetInsulationIds | 2012 | `public static ICollection < ElementId > GetInsulationIds ( Document document , ElementId elemId )` |
| Method | GetLiningIds | 2012 | `public static ICollection < ElementId > GetLiningIds ( Document document , ElementId elemId )` |
| Method | IsValidThickness | 2012 | `public static bool IsValidThickness ( double thickness )` |
| Property | HostElementId | 2012 | `public ElementId HostElementId { get ; }` |
| Property | Parameter | — | `` |
| Property | Thickness | 2012 | `public double Thickness { get ; set ; }` |